// 다음 중 저급 언어(Low-Level Language)와 고급 언어(High-Level Language)에 대한 설명으로 올바른 것을 고르시오.

// 1. 저급 언어는 개발자가 이해하기 쉬운 언어로, 컴파일러를 사용하여 기계어로 변환이 필요하다.
// 2. 고급 언어는 컴퓨터가 직접 이해할 수 있는 언어로, 기계마다 호환성이 높고 유지보수가 용이하다.
// 3. 저급 언어는 컴퓨터가 직접 이해할 수 있는 언어로, 기계마다 기계어가 상이하여 호환성이 없고 유지관리가 어렵다.
// 4. 고급 언어는 기계어로 바로 실행되며, 번역 과정 없이 빠르게 실행할 수 있다.

//? 저급 언어: 컴퓨터가 직접 이해할 수 있는 언어, 실행속도 빠름, 기계마다 기계어 상이해서 호환성 없고, 유지관리 어려움

//? 고급 언어: 개발자가 이해할 수 있도록 소스코드를 작성할 수 있는 언어, 실행을 위해서 번역 필요

// 1번 -> 고급 언어에 대한 설명 (X)
// 2번 -> 저급 언어에 대한 설명 (X)
// 3번 -> 저급 언어에 대한 설명 (O)
// 4번 -> 저급 언어에 대한 설명 (X)