// JavaScript는 웹 개발에서 매우 중요한 역할을 합니다. 다음 중 JavaScript의 특성에 대한 설명으로 옳은 것을 모두 고르시오.

// 정답: 1, 4, 5
// 1. JavaScript는 인터프리터 방식으로 실행되며, 대부분의 웹 브라우저에 내장된 스크립트 엔진에서 실행된다.
// >> o 동적이며 타입을 명시할 필요가 없는 인터프리터 언어 이다.

// 2. JavaScript는 서버 측에서 실행되며, 웹 페이지의 데이터를 처리하고 서버와 통신하는 데 주로 사용된다.
// >> node.js를 통해 서버 측에서 실행할 수 있도록 함


// 3. JavaScript는 변수 선언 시 강력한 타입 검사를 요구하며, 컴파일 시 타입 오류를 사전에 잡아낸다. > 느슨한 타입 검사 요구, 동적 언어타입으로 컴파일 시 타입 오류를 사전에 잡아내지 않고, 런타임 시 오류 잡음

// 4. JavaScript는 비동기 처리를 지원하여, 웹 페이지의 일부 요소를 비동기적으로 업데이트하는 데 적합하다.
// 콜백 함수, Promise 및 async/await 구문을 사용하여 비동기 프로그래밍을 지원


// 5. JavaScript는 보안과 성능에서 다른 언어들에 비해 부족할 수 있으나, 개발 속도와 확장성이 뛰어나다. >> O


// 객체지향 프로그래밍과 함수형 프로그래밍을 모두 표현할 수 있다.
// HTML의 내용, 속성, 스타일을 변경 할 수 있다.
// 이벤트를 처리하고 사용자와의 상호작용을 가능하게 함.